(function() {
	'use strict';

	const articles = [
		{
			id: 1,
			title: '# Заголовок статьи',
			content: `
Далеко-далеко за [словесными горами в стране](#), гласных и согласных живут рыбные тексты. Использовало однажды гор семь, снова раз. Города большой безорфографичный меня.

Lorem имени, продолжил своего реторический своих послушавшись грустный даль страну парадигматическая океана рыбными, рыбного переписывается, страна? Свой заголовок свое, он.

## Заголовок второго уровня

Что, повстречался последний всеми его щеке не, знаках встретил использовало, прямо, раз свой. Города силуэт, заглавных всеми, свою прямо но!
Текстов которой вскоре журчит рекламных свою, сбить на берегу рот. Великий страну проектах знаках над что путь языком, подпоясал, свой они!

### Заголовок третьего уровня

Скатился переулка первую единственное имени над запятых, грустный заголовок переписывается власти переписали. Букв строчка вскоре продолжил, страна злых раз страну.

Букв переписали, продолжил. Силуэт, путь текста журчит переписывается назад от всех его выйти однажды, бросил букв, путь несколько вскоре даже рукопись.
			`
		},
		{
			id: 2,
			title: 'Lorem',
			content: `
				Lorem ipsum dolor sit amet consectetur adipisicing elit. Voluptate, expedita impedit soluta vel quisquam cum tempore placeat modi velit natus id voluptatem accusantium voluptatibus cumque eaque eius nulla odit eos?
			`
		},
		{
			id: 3,
			title: 'Lorem, ipsum.',
			content: `
				Lorem ipsum dolor sit amet consectetur adipisicing elit. Magni similique pariatur repellendus quaerat eaque ea recusandae voluptatem, quisquam quod perspiciatis quos, obcaecati eos laudantium facilis quasi esse iusto explicabo cumque! Cupiditate, nemo consequatur. Expedita ipsum blanditiis soluta ipsam accusamus, eaque autem dolores tenetur eos alias amet neque dolorum id officiis fuga rerum, architecto incidunt odio voluptatibus quia? Ex beatae porro aspernatur debitis culpa suscipit dolores facilis nisi ipsum eos quam reprehenderit, illo amet quas sit obcaecati fugiat modi distinctio eaque vero aliquam provident? Ex iure cumque quas necessitatibus dolores, eveniet ipsum optio vel quisquam consequuntur adipisci. Consequatur deleniti ea vitae.
			`
		},
		{
			id: 4,
			title: 'Мейн-кун',
			content: `
__Мейн-ку́н__ ([англ.](https://ru.wikipedia.org/wiki/%D0%90%D0%BD%D0%B3%D0%BB%D0%B8%D0%B9%D1%81%D0%BA%D0%B8%D0%B9_%D1%8F%D0%B7%D1%8B%D0%BA) maine coon) — порода [кошек](https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D1%88%D0%BA%D0%B0), которая произошла от кошек [штата Мэн](https://ru.wikipedia.org/wiki/%D0%9C%D1%8D%D0%BD_(%D1%88%D1%82%D0%B0%D1%82)) в Северо-Восточной Америке. Аборигенная порода кошек Северной Америки. Название "maine coon" переводится как "Мэнский енот", отсюда происходит второе название этой породы - мэнская енотовая кошка.

![Мейн-ку́н](https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Karin_Maine_Coon.jpg/400px-Karin_Maine_Coon.jpg "Мейн-кун")

## История породы

Порода сформировалась естественным образом под воздействием суровых климатических условий штата Мэн, хотя существуют и «альтернативные» версии (разного рода легенды) о происхождении мэйн-кунов. В литературе мейн-куны впервые упоминаются в 1861 году. К этому времени относится статья о коте по кличке Капитан Дженкс с корабля «Морская лошадь».

Он был показан на выставках в Бостоне и Нью-Йорке в 1861 году и положил начало ранней популярности породы, но на рубеже XIX—XX веков мейн-кунов опередили более пушистые персы. Мейн-куну как породе удалось выжить только благодаря тому, что фермеры отдавали должное его размерам и охотничьим качествам.

Современный стандарт породы был принят в 1967 году, а в 1990-х мейн-кунов настигла настоящая популярность. Но впервые зарегистрированы в качестве породы мейн-куны были в 1908 году в фелинологической федерации CFA, где кот породы мейн-кун по кличке Molly Bond стал пятым зарегистрированным в этой федерации животным.

С 2002 года Генеральной Ассамблеей [WCF](https://ru.wikipedia.org/wiki/%D0%92%D1%81%D0%B5%D0%BC%D0%B8%D1%80%D0%BD%D0%B0%D1%8F_%D1%84%D0%B5%D0%B4%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D1%8F_%D0%BA%D0%BE%D1%88%D0%B5%D0%BA) на встрече в Милане принято решение о том, что на основании данных о генотипе этой породы допустимы межпородные вязки мейн-кунов с кошками следующих пород: норвежская лесная, турецкая ангора, сибирская. Решение о необходимости и уместности таких вязок принимается руководителем клуба.


## Питание

В специальной диете мейн-куны не нуждаются. Однако это крупные, энергичные, подвижные животные, поэтому их пища должна быть качественной, богатой белками и питательными веществами. Можно использовать как сухой, так и консервированный корм. Консервированные корма следует добавлять к сухим только 2—3 раза в неделю. Качественный сухой корм позволяет уменьшить образование зубного камня. Кошкам этой породы наиболее подходят высокобелковые корма, поскольку кошка является облигатным хищником, а у аборигенных пород это наиболее выражено по сравнению с искусственно выведенными. При использовании натурального питания мясо должно составлять 70-80 % рациона, остальное — яйца, каши, овощи, молочные продукты, морепродукты, зелень, витаминные добавки. При выращивании котят мейн-кунов на полностью натуральном рационе использование витаминных и минеральных добавок является обязательным. Не рекомендуется без необходимости переходить с одного корма и типа питания на другой (или смешивать корма разных производителей). Также имеет значение материал кошачьей посуды. Пластмассовые миски могут вызвать аллергическую сыпь на подбородке животного. Лучше всего использовать посуду из стекла или нержавеющей стали.
			`
		}
	];

	if (!localStorage.getItem('articles')) {
		localStorage.setItem('articles', JSON.stringify(articles));
	}
})();
